import Container from "@/components/Container/Container";
import TestimonialSlider from "@/components/TestimonialSlider/TestimonialSlider";
import StoreSlider from "@/components/StoreSlider/StoreSlider";
import HeroSlider from "@/components/HeroSlider/HeroSlider";
import Image from "next/image";
import HeadsetSlider from "@/components/HeadsetSlider/HeadsetSlider";
import React from "react";
import Link from "next/link";
import PlanSlider from "@/components/PlanSlider/PlanSlider";
import BlogSlider from "@/components/BlogSlider/BlogSlider";
import ConsoleSlider from "@/components/ConsoleSlider/ConsoleSlider";
import AnimatedBackground from "@/components/AnimatedBackground/AnimatedBackground";

export default function Home() {

    return (
        <>
            <AnimatedBackground />
            <Container>
                <section className={`pb-6 lg:pb-[167px] pt-[197px]`}>
                    <div className={`font-vazir`}>
                        <div className={`grid grid-cols-12 gap-6 items-center`}>
                            <div className={`col-span-12 lg:col-span-5 order-2 lg:order-1`}>
                                <StoreSlider/>
                            </div>
                            <div className={`col-span-12 lg:col-span-7 order-1 lg:order-2`}>
                                <h2 className={`text-4xl lg:text-[60px]/[120px] font-bold text-secondary mb-[9px]`}>به
                                    دنیای بازی‌ها خوش آمدید</h2>
                                <p className={`text-justify text-base text-secondary mb-[23px]`}>لورم ایپسوم متن ساختگی
                                    با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و
                                    متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی
                                    مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.</p>
                                <TestimonialSlider/>
                            </div>
                        </div>
                    </div>
                </section>
            </Container>

            <section>
                <HeroSlider/>
            </section>

            <Container>
                <section className={`pt-8 pb-[113px]`}>
                    <h2 className={`bg-radial from-[#C1C2EF] text-center text-secondary text-5xl py-1.5 font-bold to-transparent mb-[49px]`}>چرا
                        ما؟</h2>
                    <div className={`grid grid-cols-12 gap-6 max-w-[872px] mx-auto w-full`}>
                        <div className={`col-span-12 lg:col-span-6`}>
                            <Image className={`w-full object-cover`} src={`/why/1.png`} alt={'why1'} width={424}
                                   height={308}/>
                        </div>
                        <div className={`col-span-12 lg:col-span-6`}>
                            <Image className={`w-full object-cover`} src={`/why/2.png`} alt={'why2'} width={424}
                                   height={308}/>
                        </div>
                        <div className={`col-span-12 lg:col-span-6`}>
                            <Image className={`w-full object-cover`} src={`/why/3.png`} alt={'why3'} width={424}
                                   height={308}/>
                        </div>
                        <div className={`col-span-12 lg:col-span-6`}>
                            <Image className={`w-full object-cover`} src={`/why/4.png`} alt={'why4'} width={424}
                                   height={308}/>
                        </div>
                    </div>
                </section>
            </Container>

            <Container>
                <section className={`pb-6 lg:pb-20`}>
                    <HeadsetSlider/>
                </section>
            </Container>

            <Container className={`pb-6 lg:pb-[85px]`}>
                <section className={`relative lg:pt-[83px] pb-18 bg-[#c1c2ef80] rounded-tr-[60px] rounded-bl-[30px]`}>
                    <Image className={`absolute bottom-0 left-0`} src={'/robot.webp'} alt={'robot'} width={281}
                           height={184}/>
                    <div className={`pt-12 pb-[170px] lg:py-[180px] px-4 lg:px-24 text-center`}>
                        <h2 className={`text-3xl lg:text-5xl/[52px] font-bold text-secondary mb-12`}>راهنمای خرید</h2>
                        <div className={`text-secondary text-xl lg:text-xl/[75px]`}>
                            <p>1. گیم مورد نظرت رو انتخاب کن</p>
                            <p>2. از طریق درگاه بانکی پرداخت خودتون رو انجام بدید</p>
                            <p>3. اطلاعات مربوط به اکانت خریداری شده رو تو تلگرامت پیگیری کن.</p>
                        </div>
                    </div>
                </section>
            </Container>

            <Container>
                <section className={`text-center pb-[13px]`}>
                    <ConsoleSlider />
                </section>
            </Container>

            <Container>
                <section className={`py-6 lg:py-[129px]`}>
                    <PlanSlider/>
                </section>
            </Container>

            <Container>
                <section className={`pt-[76px] pb-[60px] md:px-6`}>
                    <h2 className={`text-2xl md:text-4xl lg:text-5xl font-bold text-secondary text-center mb-[28px]`}>به‌روزترین اخبار دنیای
                        سونی در سایبر گیم‌استور</h2>
                    <p className={`text-base md:text-lg text-[#3200AEBF] text-justify lg:text-center mb-[28px] px-2 md:px-4 lg:px-0`}>تو بخش اخبار سایبر گیم‌استور، همیشه
                        یه قدم جلوتر از دنیای سونی باش! ما به‌روزترین اخبار رو از بازی‌های جدید، آپدیت‌های کنسول‌های PS4
                        و PS5، رویدادهای ویژه و حتی شایعات هیجان‌انگیز براتون جمع‌آوری کردیم. اینجا هر گیمری می‌تونه
                        سریع و ساده با آخرین اتفاقات دنیای سونی همراه بشه. خبرها رو بخون، نظرت رو بگو و با ما تو جریان
                        باش</p>
                    <BlogSlider/>
                    <div className="relative flex justify-center mt-[107px] mb-[31px] px-4 md:px-6 lg:px-0">
                        <div
                            className="absolute w-full max-w-[600px] h-full rounded-full bg-primary opacity-70 blur-3xl z-0"></div>
                        <Image className={`relative z-10 w-full max-w-[480px] h-auto`} src={`/ps5.png`} alt={`ps5`} width={480} height={320}/>
                    </div>
                    <p className={`text-justify text-base px-4 md:px-6 lg:px-0 w-full overflow-hidden`}>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و
                        با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم
                        است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می
                        باشد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک
                        است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی
                        تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.</p>
                </section>
            </Container>

            <footer>
                <Container>
                    <div className={`flex flex-col lg:flex-row items-center justify-between mb-[85px]`}>
                        <div className={`mb-12 lg:mb-0`}>
                            <div className={`flex items-center gap-3.5 mb-[42px]`}>
                                <Image src={`/logo.png`} alt={`logo`} width={59} height={59}/>
                                <h2 className={`text-3xl text-secondary`}>سایبر <span className={`text-primary`}>گیم استور</span>
                                </h2>
                            </div>
                            <div className={`flex items-center justify-center gap-[41px] mb-[42px]`}>
                                <Link href={`#`}>
                                    <svg xmlns="http://www.w3.org/2000/svg" width="41" height="41" viewBox="0 0 41 41"
                                         fill="none">
                                        <g clipPath="url(#clip0_644_3011)">
                                            <path
                                                d="M18.3668 0.646702C11.3396 1.38004 5.06066 6.00644 2.20626 12.5534C0.366793 16.78 0.0606592 21.6467 1.36679 26.127C2.98013 31.7134 7.15346 36.4331 12.5535 38.7936C16.7801 40.6331 21.6468 40.9392 26.1273 39.6331C32.8335 37.6998 38.1137 32.1936 39.8471 25.3531C42.5532 14.6334 35.9135 3.67257 25.1668 1.11337C22.8063 0.553369 20.7273 0.406435 18.3668 0.646702ZM18.6335 13.0334C20.3396 15.3 21.7801 17.1667 21.8335 17.1667C21.8868 17.1667 23.6607 15.3 25.7535 13.0334L29.5801 8.90003H31.7535L31.2868 9.3939C31.0201 9.67284 29.2868 11.5531 27.4335 13.5667C25.5801 15.58 23.7668 17.5395 23.4063 17.9L22.7668 18.58L27.7668 25.2334C30.5135 28.9 32.7668 31.9395 32.7668 31.9939C32.7668 32.0606 31.1273 32.1 29.1396 32.1L25.5001 32.0867L22.1135 27.5534C19.7801 24.42 18.6868 23.0726 18.5801 23.1534C18.5001 23.22 16.6063 25.2606 14.3668 27.6867L10.3001 32.1H9.27293C8.70013 32.1 8.23346 32.0728 8.23346 32.0334C8.23346 31.9939 10.3535 29.6728 12.9396 26.8867C15.5137 24.1 17.6471 21.7667 17.6729 21.7272C17.6868 21.6728 15.5668 18.78 12.9668 15.3C10.3668 11.8334 8.23346 8.9667 8.23346 8.9395C8.23346 8.91364 9.87293 8.90003 11.8868 8.90003H15.5396L18.6335 13.0334Z"
                                                fill="black"/>
                                            <path
                                                d="M11.5274 10.6867C11.5805 10.78 14.9397 15.2867 18.9669 20.6728L26.3002 30.4864L27.9397 30.5C28.9533 30.5 29.5669 30.4467 29.5397 30.3667C29.5274 30.3 26.1805 25.7939 22.1274 20.3667L14.7397 10.5H13.0869C11.7141 10.5 11.4335 10.5272 11.5274 10.6867Z"
                                                fill="black"/>
                                        </g>
                                        <defs>
                                            <clipPath id="clip0_644_3011">
                                                <rect width="40" height="40" fill="white"
                                                      transform="translate(0.5 0.5)"/>
                                            </clipPath>
                                        </defs>
                                    </svg>
                                </Link>
                                <Link href={`#`}>
                                    <svg xmlns="http://www.w3.org/2000/svg" width="41" height="41" viewBox="0 0 41 41"
                                         fill="none">
                                        <path
                                            d="M37.6077 4.5463C37.1331 4.15152 36.5604 3.89279 35.9505 3.79764C35.3406 3.70249 34.7163 3.77448 34.1441 4.00595L4.27594 16.0649C3.63719 16.3277 3.09346 16.7785 2.71694 17.3576C2.34041 17.9366 2.14888 18.6165 2.16778 19.3069C2.18667 19.9974 2.4151 20.6657 2.82273 21.2233C3.23037 21.7809 3.79794 22.2013 4.4501 22.4288L10.4918 24.53L13.8593 35.6661C13.905 35.8149 13.9714 35.9565 14.0566 36.0868C14.0695 36.1068 14.0877 36.1216 14.1014 36.1411C14.1998 36.2783 14.3186 36.3996 14.4538 36.5007C14.4923 36.53 14.5291 36.5574 14.5702 36.5835C14.7284 36.6884 14.9036 36.7652 15.0881 36.8103L15.1078 36.812L15.119 36.8168C15.2299 36.8393 15.3427 36.8508 15.4559 36.851C15.4668 36.851 15.4765 36.8457 15.4872 36.8456C15.658 36.8426 15.8273 36.8132 15.9891 36.7584C16.0267 36.7456 16.0589 36.7241 16.0955 36.7086C16.2161 36.6586 16.3304 36.5946 16.4359 36.5177C16.5205 36.4465 16.605 36.3752 16.6896 36.3041L21.1932 31.3318L27.9104 36.5352C28.5017 36.9956 29.2296 37.2459 29.979 37.2465C30.7643 37.2455 31.5254 36.9745 32.1347 36.479C32.744 35.9836 33.1644 35.2937 33.3254 34.5251L38.7632 7.83082C38.8865 7.23001 38.844 6.60701 38.6405 6.02846C38.4369 5.44992 38.0799 4.93759 37.6077 4.5463ZM16.1168 25.0606C15.8857 25.2908 15.7277 25.5841 15.6627 25.9037L15.1468 28.4104L13.8401 24.0886L20.6155 20.5604L16.1168 25.0606ZM29.953 33.9001L22.0152 27.751C21.6831 27.4944 21.2665 27.3723 20.8484 27.4091C20.4304 27.4459 20.0415 27.6389 19.7593 27.9496L18.317 29.5416L18.8267 27.0642L30.6317 15.2592C30.9135 14.9778 31.0852 14.6047 31.1157 14.2077C31.1461 13.8106 31.0334 13.4158 30.7979 13.0947C30.5624 12.7736 30.2196 12.5474 29.8318 12.4572C29.4439 12.367 29.0365 12.4187 28.6835 12.6029L11.7414 21.424L5.53409 19.1524L35.4982 7.16508L29.953 33.9001Z"
                                            fill="black"/>
                                    </svg>
                                </Link>
                                <Link href={`#`}>
                                    <svg xmlns="http://www.w3.org/2000/svg" width="41" height="41" viewBox="0 0 41 41"
                                         fill="none">
                                        <path
                                            d="M29.4002 9.60016C29.0046 9.60016 28.6179 9.71746 28.289 9.93722C27.9601 10.157 27.7038 10.4693 27.5524 10.8348C27.401 11.2002 27.3614 11.6024 27.4386 11.9903C27.5158 12.3783 27.7062 12.7347 27.9859 13.0144C28.2657 13.2941 28.622 13.4846 29.01 13.5617C29.3979 13.6389 29.8001 13.5993 30.1655 13.4479C30.531 13.2965 30.8433 13.0402 31.0631 12.7113C31.2829 12.3824 31.4002 11.9957 31.4002 11.6002C31.4002 11.0697 31.1894 10.561 30.8144 10.1859C30.4393 9.81088 29.9306 9.60016 29.4002 9.60016ZM37.0668 13.6335C37.0344 12.2507 36.7754 10.8825 36.3002 9.5835C35.8764 8.47205 35.2168 7.46563 34.3668 6.6335C33.5415 5.77921 32.5328 5.12379 31.4168 4.71683C30.1213 4.2271 28.7516 3.96218 27.3668 3.9335C25.6002 3.8335 25.0335 3.8335 20.5002 3.8335C15.9668 3.8335 15.4002 3.8335 13.6335 3.9335C12.2487 3.96218 10.8791 4.2271 9.5835 4.71683C8.46962 5.12791 7.46172 5.78276 6.6335 6.6335C5.77921 7.45879 5.12379 8.46756 4.71683 9.5835C4.2271 10.8791 3.96218 12.2487 3.9335 13.6335C3.8335 15.4002 3.8335 15.9668 3.8335 20.5002C3.8335 25.0335 3.8335 25.6002 3.9335 27.3668C3.96218 28.7516 4.2271 30.1213 4.71683 31.4168C5.12379 32.5328 5.77921 33.5415 6.6335 34.3668C7.46172 35.2176 8.46962 35.8724 9.5835 36.2835C10.8791 36.7732 12.2487 37.0381 13.6335 37.0668C15.4002 37.1668 15.9668 37.1668 20.5002 37.1668C25.0335 37.1668 25.6002 37.1668 27.3668 37.0668C28.7516 37.0381 30.1213 36.7732 31.4168 36.2835C32.5328 35.8765 33.5415 35.2211 34.3668 34.3668C35.2206 33.5378 35.8807 32.5305 36.3002 31.4168C36.7754 30.1178 37.0344 28.7497 37.0668 27.3668C37.0668 25.6002 37.1668 25.0335 37.1668 20.5002C37.1668 15.9668 37.1668 15.4002 37.0668 13.6335ZM34.0668 27.1668C34.0547 28.2248 33.8631 29.273 33.5002 30.2668C33.2341 30.9922 32.8066 31.6475 32.2502 32.1835C31.7096 32.7343 31.0555 33.1609 30.3335 33.4335C29.3397 33.7964 28.2914 33.988 27.2335 34.0002C25.5668 34.0835 24.9502 34.1002 20.5668 34.1002C16.1835 34.1002 15.5668 34.1002 13.9002 34.0002C12.8016 34.0207 11.7078 33.8516 10.6668 33.5002C9.97647 33.2136 9.35242 32.7881 8.8335 32.2502C8.28031 31.7147 7.85823 31.0588 7.60016 30.3335C7.19326 29.3254 6.96757 28.2534 6.9335 27.1668C6.9335 25.5002 6.8335 24.8835 6.8335 20.5002C6.8335 16.1168 6.8335 15.5002 6.9335 13.8335C6.94097 12.7519 7.13841 11.6801 7.51683 10.6668C7.81024 9.96335 8.2606 9.33626 8.8335 8.8335C9.33985 8.26044 9.96564 7.80532 10.6668 7.50016C11.6827 7.13357 12.7535 6.94196 13.8335 6.9335C15.5002 6.9335 16.1168 6.8335 20.5002 6.8335C24.8835 6.8335 25.5002 6.8335 27.1668 6.9335C28.2248 6.94563 29.273 7.13724 30.2668 7.50016C31.0242 7.78125 31.704 8.23824 32.2502 8.8335C32.7963 9.34546 33.2231 9.97138 33.5002 10.6668C33.8706 11.6817 34.0623 12.7531 34.0668 13.8335C34.1502 15.5002 34.1668 16.1168 34.1668 20.5002C34.1668 24.8835 34.1502 25.5002 34.0668 27.1668ZM20.5002 11.9502C18.8098 11.9535 17.1584 12.4577 15.7546 13.3992C14.3507 14.3407 13.2575 15.6772 12.6129 17.2398C11.9683 18.8023 11.8014 20.5209 12.1332 22.1784C12.4649 23.8358 13.2806 25.3577 14.477 26.5518C15.6734 27.7459 17.1968 28.5585 18.8549 28.8871C20.513 29.2156 22.2313 29.0453 23.7926 28.3977C25.3539 27.7501 26.6883 26.6542 27.627 25.2486C28.5658 23.8429 29.0668 22.1905 29.0668 20.5002C29.069 19.3753 28.8488 18.2612 28.4189 17.2218C27.989 16.1823 27.3578 15.2382 26.5616 14.4436C25.7655 13.649 24.8201 13.0196 23.7798 12.5917C22.7396 12.1638 21.625 11.9458 20.5002 11.9502ZM20.5002 26.0502C19.4025 26.0502 18.3294 25.7247 17.4167 25.1148C16.5041 24.505 15.7927 23.6382 15.3726 22.6241C14.9526 21.6099 14.8427 20.494 15.0568 19.4174C15.271 18.3408 15.7995 17.3519 16.5757 16.5757C17.3519 15.7995 18.3408 15.271 19.4174 15.0568C20.494 14.8427 21.6099 14.9526 22.6241 15.3726C23.6382 15.7927 24.505 16.5041 25.1148 17.4167C25.7247 18.3294 26.0502 19.4025 26.0502 20.5002C26.0502 21.229 25.9066 21.9507 25.6277 22.6241C25.3488 23.2974 24.94 23.9092 24.4246 24.4246C23.9092 24.94 23.2974 25.3488 22.6241 25.6277C21.9507 25.9066 21.229 26.0502 20.5002 26.0502Z"
                                            fill="black"/>
                                    </svg>
                                </Link>
                            </div>
                            <div>
                                <Link href={`#`}>
                                    <Image className={`mx-auto`} src={`/enamad.png`} alt={`enamad`} width={142}
                                           height={197}/>
                                </Link>
                            </div>
                        </div>
                        <div className={`space-y-11 mb-12 lg:mb-0`}>
                            <div className={`flex items-center justify-center lg:justify-start gap-3.5`}>
                                <svg xmlns="http://www.w3.org/2000/svg" width="33" height="25" viewBox="0 0 33 25"
                                     fill="none">
                                    <path
                                        d="M27.2951 1.29363L25.2592 2.8842L16.5906 9.326L7.92201 2.82058L5.88609 1.23001C5.40646 0.833236 4.82096 0.585895 4.20214 0.51863C3.58331 0.451365 2.95834 0.567132 2.40467 0.85159C1.85099 1.13605 1.39294 1.57669 1.08725 2.11894C0.781568 2.66118 0.641686 3.28119 0.684936 3.90216V22.3368C0.684936 22.9105 0.91284 23.4608 1.31851 23.8664C1.72419 24.2721 2.2744 24.5 2.84811 24.5H7.92201V12.2208L16.5906 18.7262L25.2592 12.2208V24.5H30.3331C30.9068 24.5 31.457 24.2721 31.8627 23.8664C32.2684 23.4608 32.4963 22.9105 32.4963 22.3368V3.90216C32.5261 3.28655 32.3765 2.67552 32.0656 2.14335C31.7547 1.61118 31.2959 1.18078 30.745 0.90447C30.1941 0.628164 29.5747 0.51785 28.9623 0.586937C28.3498 0.656024 27.7706 0.901537 27.2951 1.29363Z"
                                        fill="#112B46"/>
                                </svg>
                                <span className={`text-primary text-base`}>smatrix73@gmail.com</span>
                            </div>
                            <div className={`flex items-center justify-center lg:justify-start gap-3.5`}>
                                <svg xmlns="http://www.w3.org/2000/svg" width="25" height="25" viewBox="0 0 25 25"
                                     fill="none">
                                    <path
                                        d="M3.85844 19.7609V24.3336L5.69796 23.2299L11.48 19.7609H17.2147C18.554 19.7609 19.6431 18.6718 19.6431 17.3325V7.61884C19.6431 6.27957 18.554 5.19043 17.2147 5.19043H2.64423C1.30496 5.19043 0.21582 6.27957 0.21582 7.61884V17.3325C0.21582 18.6718 1.30496 19.7609 2.64423 19.7609H3.85844ZM2.64423 7.61884H17.2147V17.3325H10.8073L6.28685 20.045V17.3325H2.64423V7.61884Z"
                                        fill="#112B46"/>
                                    <path
                                        d="M22.0716 0.333496H7.50117C6.1619 0.333496 5.07275 1.42264 5.07275 2.76191H19.6432C20.9825 2.76191 22.0716 3.85105 22.0716 5.19032V14.904C23.4109 14.904 24.5001 13.8148 24.5001 12.4756V2.76191C24.5001 1.42264 23.4109 0.333496 22.0716 0.333496Z"
                                        fill="#112B46"/>
                                </svg>
                                <span className={`text-primary text-base`}>چت آنلاین سایت از ساعت 12 ظهر تا ۱۲ شب فعال است.</span>
                            </div>
                            <div className={`flex items-center justify-center lg:justify-start gap-3.5`}>
                                <svg xmlns="http://www.w3.org/2000/svg" width="29" height="25" viewBox="0 0 29 25"
                                     fill="none">
                                    <path
                                        d="M26.1166 8.10664L28.3232 5.90005L26.327 3.90381L23.9157 6.31369C22.4333 5.42428 20.7053 4.90193 18.8531 4.90193C13.4051 4.90193 8.9707 9.33488 8.9707 14.7843C8.9707 20.2337 13.4051 24.6667 18.8531 24.6667C24.3011 24.6667 28.7354 20.2337 28.7354 14.7843C28.7343 12.3081 27.7991 9.92345 26.1166 8.10664ZM18.8531 21.8431C14.9608 21.8431 11.7942 18.6765 11.7942 14.7843C11.7942 10.8921 14.9608 7.72546 18.8531 7.72546C22.7453 7.72546 25.9119 10.8921 25.9119 14.7843C25.9119 18.6765 22.7453 21.8431 18.8531 21.8431Z"
                                        fill="#112B46"/>
                                    <path
                                        d="M17.4412 10.5489H20.2647V16.1959H17.4412V10.5489ZM16.0294 0.666504H21.6765V3.49004H16.0294V0.666504ZM1.91177 7.72534H7.55884V10.5489H1.91177V7.72534ZM1.91177 19.0195H7.55884V21.843H1.91177V19.0195ZM0.5 13.3724H6.13295V16.1959H0.5V13.3724Z"
                                        fill="#112B46"/>
                                </svg>
                                <span className={`text-primary text-base`}>دارای سیستم سفارش‌گیری ۲۴ ساعته٬ فعال در تمامی روزهای هفته.</span>
                            </div>
                            <div className={`flex items-center justify-center lg:justify-start gap-3.5`}>
                                <svg xmlns="http://www.w3.org/2000/svg" width="29" height="25" viewBox="0 0 29 25"
                                     fill="none">
                                    <path
                                        d="M10.3984 5.37352L0.651367 0.5V18.9303L10.3984 23.8038L18.753 19.6265L28.5001 24.5V6.06974L18.753 1.19622L10.3984 5.37352ZM18.753 16.6773L10.3984 20.8546V8.3227L18.753 4.14539V16.6773Z"
                                        fill="#112B46"/>
                                </svg>
                                <span className={`text-primary text-base`}>خوزستان٬ دزفول</span>
                            </div>
                        </div>
                        <div className={`space-y-6 text-center lg:text-start`}>
                            <Link className={`text-2xl/[116%] text-primary font-medium block`} href={`#`}>خانه</Link>
                            <Link className={`text-2xl/[116%] text-primary font-medium block`} href={`#`}>فروشگاه</Link>
                            <Link className={`text-2xl/[116%] text-primary font-medium block`} href={`#`}>درباره ما</Link>
                            <Link className={`text-2xl/[116%] text-primary font-medium block`} href={`#`}>تماس با ما</Link>
                            <Link className={`text-2xl/[116%] text-primary font-medium block`} href={`#`}>وبلاگ</Link>
                        </div>
                    </div>
                    <div className={`text-center text-primary mb-[50px]`}>این وبسایت متعلق به گیم استور بوده و تمامی حقوق آن محفوظ است.</div>
                </Container>
            </footer>
        </>
    );
}
